# DataFrame
- 2차원 배열
- 행과 열로 구성

In [2]:
import pandas as pd

In [1]:
# dictionay 생성
dict_data = {'c0': [1, 2, 3], 'c1': [4, 5, 6], 'c2': [7, 8, 9], 'c3': [10, 11, 12], 'c4': [13, 14, 15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [4]:
# DataFrame 생성
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [9]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame([[15, '남', '서울'], [17, '여', '부산']], columns=['나이', '성별', '지역'], index=['준서', '예은'])
df

    나이 성별  지역
준서  15  남  서울
예은  17  여  부산

In [11]:
# 행과 열 이름 확인하기
print(df.index)
print(df.columns)

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '지역'], dtype='object')

In [12]:
# 행 인덱스, 열 이름 변경하기
df.index = ['학생1', '학생2']
df.columns = ['연령', '남녀', '도시']

print(df)

     연령 남녀  도시
학생1  15  남  서울
학생2  17  여  부산

In [16]:
df = pd.DataFrame([[15, '남', '서울'], [17, '여', '부산']], columns=['나이', '성별', '지역'], index=['준서', '예은'])
print(df)

# df에 따로 할당하지 않아도 바로 적용: inplace=True
df.rename(index={'준서': '학생1', '예은': '학생2'}, columns={'나이': '연령', '성별': '남녀', '지역': '도시'}, inplace=True)
print(df)

    나이 성별  지역
준서  15  남  서울
예은  17  여  부산
     연령 남녀  도시
학생1  15  남  서울
학생2  17  여  부산

In [18]:
df = pd.DataFrame([[15, '남', '서울'], [17, '여', '부산']], columns=['나이', '성별', '지역'], index=['준서', '예은'])
print(df)
# rename 함수를 이용해 df의 행 인덱스 중에서, 준서를 학생1로, 예은을 학생2로 변경
df.rename(index={'준서': '학생1', '예은': '학생2'}, inplace=True)
print(df)

    나이 성별  지역
준서  15  남  서울
예은  17  여  부산
     나이 성별  지역
학생1  15  남  서울
학생2  17  여  부산

In [19]:
df = pd.DataFrame([[90, 98, 85, 100],[80,89,95,100],[70,95,100,90]],columns=['수학', '영어', '음악', '체육'], index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95  100
인아  70  95  100   90

In [20]:
df = pd.DataFrame({'수학':[90,80,70], '영어':[98,89,95], '음악':[85,95,100], '체육':[100,100,90]}, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95  100
인아  70  95  100   90

### 행 삭제

In [37]:
df2 = df.copy()

# df2의 index가 '우현'인 행을 삭제
df2.drop('우현', axis='rows', inplace=True)
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [36]:
# df3의 index가 우현과 인아인 행을 삭제
df3 = df.drop(['우현', '인아'], axis='rows')
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [35]:
# df3의 열이 수학인 행을 삭제
df3 = df.copy()
df3.drop('수학', axis='columns', inplace=True)
df3

    영어   음악   체육
서준  98   85  100
우현  89   95  100
인아  95  100   90

In [34]:
# df3의 열이 수학과 영어인 행을 삭제
df3 = df.copy()
df3.drop(['수학', '영어'], axis='columns', inplace=True)
df3

     음악   체육
서준   85  100
우현   95  100
인아  100   90

In [31]:
# df3의 열이 수학과 영어인 행을 삭제, 인덱스가 인아인 행을 삭제
df3 = df.copy()
df3.drop(['수학', '영어'], axis=1, inplace=True)
df3.drop('인아', axis=0, inplace=True)
df3

    음악   체육
서준  85  100
우현  95  100